Ruby/log/soap/_getClasses_request.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:GetClasses xmlns:n1="http://clients.mindbodyonline.com/api/0_5">
      <n1:Request>
      </n1:Request>
    </n1:GetClasses>
  </env:Body>
</env:Envelope>